//LAPJO01C JOB 129300000
//STEP10    EXEC PGM=HELLO
//STEPLIB   DD DSN=LAPJO01.PUBLIC.CBL.LOADLIB,DISP=SHR
//OUT1      DD SYSOUT=*
//OUT2      DD SYSOUT=*
