//LAPJO01C JOB (129300000),LAPJO01,
//             CLASS=A,
//             MSGCLASS=X,
//             MSGLEVEL=(1,1),
//             NOTIFY=LAPJO01
//STEP1     EXEC PGM=IEBCOPY
//SYSPRINT  DD SYSOUT=*
//DDIN      DD DSNAME=LAPJO01.PUBLIC.CBL.LOADLIB,DISP=SHR
//DDOUT     DD DSNAME=LAPJO01.PUBLIC.TEST.LOADLIB,
//             DISP=SHR
//SYSUT3    DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSIN     DD *
GROUPCPY   COPYGRP  INDD=((DDIN,R)),OUTDD=DDOUT
           SELECT   MEMBER=(HELLO)
/*
